tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "AdoptOpenJDK/openjdk"
tap "mongodb/brew"

### convenience and small apps
brew "jq"
brew "tldr"
brew "htop"
brew "git"
brew "bash-completion"
brew "bash-git-prompt"
brew "speedtest-cli"
brew "hstr"
brew "watson" # time tracking
brew "z"

### applications and big dependencies
# brew "apache-spark", link: false # for local spark
brew "rbenv"
brew "gcc"
brew "python"
brew "awscli"
brew "glib"
brew "graphviz"
brew "kubectl"
brew "helm"
brew "jenv"
brew "gradle"
brew "mysql"
brew "pipenv"
brew "postgresql"
brew "sbt"
brew "scala@2.13"
brew "chrome-cli"
brew "npm"
brew "wget"
brew "vim"
brew "openvpn"
brew "gnu-sed"
brew "mongodb-community@4.2"
brew "aws-iam-authenticator"
brew "scalacenter/bloop/bloop" # fast scala builds
brew "ruby"
brew "ruby-build"
# GUI type installs
cask "intellij-idea"
cask "sublime-text"
cask "visual-studio-code"
cask "google-chrome"
cask "rectangle" ## cask "spectacle" # switched to rectangle
cask "adoptopenjdk8"
cask "adoptopenjdk12"
cask "java11"
cask "java"
cask "snowflake-snowsql"
cask "sourcetree"
cask "microsoft-excel"

### flutter stuff
brew "asdf"
cask "android-sdk"
cask "android-studio"
cask "intel-haxm"
# already have adoptopenjdk8

# personal apps
cask "telegram"
cask "whatsapp"

# work apps
brew slack
brew tableau
brew 1password
cask dbvisualizer

# problem casks
# cask "java" # Xcode Developer Tools missing # didn't retest
# cask "java11" # didn't retest
# one of these two failed. Didn't retest.
# cask "adoptopenjdk8"
# cask "adoptopenjdk12"

#docker
brew docker
cask docker
brew docker-compose