tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "AdoptOpenJDK/openjdk"
tap "mongodb/brew"
brew "gcc"
# brew "apache-spark", link: false # for local spark
brew "python"
brew "awscli"
brew "bash-completion"
brew "bash-git-prompt"
brew "glib"
brew "graphviz"
brew "helm"
brew "jenv"
brew "mysql"
brew "pipenv"
brew "postgresql"
brew "sbt"
brew "scala@2.13"
cask "intellij-idea"
cask "sublime-text"
cask "visual-studio-code"
cask "google-chrome"
brew "chrome-cli"
# cask "spectacle" # switched to rectangle
cask "rectangle"
brew "npm"
cask "adoptopenjdk8"
cask "adoptopenjdk12"
cask "java11"
cask "java"
cask "snowflake-snowsql"
cask "sourcetree"
brew "wget"
brew "vim"
brew "openvpn"
brew "gnu-sed"
brew "speedtest-cli"
brew "hstr"
brew "mongodb-community@4.2"
brew "aws-iam-authenticator"
cask "eclipse-jee" # for netsuite work
