tap "homebrew/bundle"
tap "homebrew/cask-versions"
## these are "no longer necessary"
## TODO remove these two
# tap "homebrew/cask"
# tap "homebrew/core"
tap "AdoptOpenJDK/openjdk"
tap "mongodb/brew"
tap "hashicorp/tap"
tap "snyk/tap"
tap "hashicorp/tap"
tap "cloudfoundry/tap"
tap "git-duet/tap"
tap "scalacenter/bloop"
tap "minio/stable"

### convenience and small apps
brew "ansible"
brew "git-duet/tap/git-duet"
brew "jq"
brew "tldr"
brew "htop"
brew "git"
brew "git-lfs"
brew "bash-completion@2"
brew "bash-git-prompt"
brew "speedtest-cli"
brew "hstr"
# brew "watson" # time tracking
brew "z"
brew "shellcheck"

### applications and big dependencies
brew "bash" # issue: had to: brew link --overwrite bash
# brew "apache-spark", link: false # for local spark # (need for polynote)
brew "rbenv"
brew "golang"
brew "gcc"
brew "python"
brew "jupyterlab" # (when still installing "jupyter") issue: had to: brew link --overwrite jupyterlab
brew "awscli"
brew "azure-cli"
brew "cf-cli@8"

brew "glib"
brew "graphviz"
brew "kubectl" # issue: /usr/local/bin/kubectl already exists, can't link
brew "helm"
brew "jenv"
brew "gradle"
brew "mysql"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipenv"
brew "postgresql@14"
brew "sbt"
brew "scala@2.13"
brew "chrome-cli"
brew "npm"
brew "wget"
brew "vim"
brew "openvpn"
brew "gnu-sed"
brew "mongodb-community@6.0"
# ARM ISSUES START
brew "aws-iam-authenticator"
brew "scalacenter/bloop/bloop" # fast scala builds
brew "ruby"
brew "ruby-build"
# ARM ISSUES END
#use tfenv to install terraform
#brew "hashicorp/tap/terraform"
brew "chamber"
brew "direnv"
brew "tfenv"
brew "terraform-docs"
cask "anaconda" # (needed for polynote)
brew "gitlab-runner"
brew "pre-commit"
brew "gpg"
cask "gpg-suite"
brew "circleci"
brew "snyk"
brew "scorecard"
brew "hashicorp/tap/nomad"
brew "minio/stable/minio"
brew "minio/stable/mc"
brew "podman"
brew "pkl"
brew "qemu"
# brew "rust"
# manually install rustup, don't use brew for rust
# then install maturin for rust to python
# cargo install maturin
brew "ta-lib"

# packets
brew "tcpdump"
brew "wireshark"
brew "tcpreplay"

# GUI type installs
# cask "intellij-idea"
cask "arduino-ide"
cask "intellij-idea-ce"
cask "sublime-text"
cask "visual-studio-code"
cask "google-chrome"
cask "google-chrome-canary"
cask "rectangle" ## cask "spectacle" # switched to rectangle
cask "snowflake-snowsql"
cask "sourcetree"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "aws-vault"
cask "wezterm"

# TODO upgrade to OP CLI Version 2
# CLI Version 1 must be manually downloaded from here:
# https://app-updates.agilebits.com/product_history/CLI
# cask "1password-cli"
cask "drawio"
cask "aws-vpn-client"
cask "postman"
cask "element"
# https://github.com/8go/matrix-commander
cask "signal"
brew "signal-cli"

# java
cask "adoptopenjdk/openjdk/adoptopenjdk8"
# issue (failed!): Error: Cask 'adoptopenjdk8' definition is invalid: 
# 'appcast' stanza failed with: Calling the `appcast` stanza is disabled! 
# Use the `livecheck` stanza instead.
cask "adoptopenjdk12"
# issue (failed!): Error: Cask 'adoptopenjdk12' definition is invalid: 
# 'appcast' stanza failed with: Calling the `appcast` stanza is disabled! 
# Use the `livecheck` stanza instead.
brew "java11"
brew "java"
brew "groovy"

# artifactory (jfrog)
brew "jfrog-cli"

### flutter stuff
brew "asdf"
cask "android-sdk"
cask "android-studio"
# cask "intel-haxm" # fails due to AMD # "The machine doesn't support VT-X."
# already have adoptopenjdk8

# personal apps
cask "telegram"
cask "whatsapp"
cask "spotify"

# work apps
cask "slack"
cask "tableau"
cask "1password"
cask "dbvisualizer"
cask "vmware-horizon-client"

# problem casks
# cask "java" # Xcode Developer Tools missing # didn't retest
# cask "java11" # didn't retest
# one of these two failed. Didn't retest.
# cask "adoptopenjdk8"
# cask "adoptopenjdk12"

#docker
brew "docker"
cask "docker"
# issue with bash_completion:
# mv  /opt/homebrew/etc/bash_completion.d/docker /opt/homebrew/etc/bash_completion.d/docker.bkup
brew "docker-compose" # issue /usr/local/bin/docker-compose already exists, can't link


# Mac App Store
mas "Bear", id: 1091189122

# just for fun
brew "asciiquarium"

#ipfs
brew "ipfs"
cask "ipfs"
## TODO -- ensure personal auth for license
# Need to install adobe acrobat DC pro for pdf editing
cask "adobe-acrobat-pro"


#cloud tools
cask "google-cloud-sdk"

#more stuff
# hashicorp/tap/hashicorp-vagrant
brew "vagrant"
# install virtualbox